package com.example.kitchenaccountant.ui.home;

import androidx.lifecycle.LiveData;
import androidx.lifecycle.MutableLiveData;
import androidx.lifecycle.ViewModel;

public class HomeViewModel extends ViewModel {

    String message = "गीत का नाम: महा प्रसादे गोविंदे\n" +
            "\n" +
            "महा-प्रसादे गोविंदे\n" +
            "नाम-ब्राह्मणि वैष्णवे\n" +
            "स्वल्प-पुण्य-वतं राजन\n" +
            "विश्वसो नैव जयते\n" +
            "(महाभारत)\n" +
            "\n" +
            "(1)\n" +
            "भाई-रे!\n" +
            "सरीरा आबिद्या-जल, जोदेंड्रिया ताहे कल,\n" +
            "जिबे फेले बिसाया-सगोरे\n" +
            "तारा मध्ये जिह्वा अति, लोभमोय सुदुरमति\n" +
            "ता'के जेता कथिना सोमसारे\n" +
            "\n" +
            "(2)\n" +
            "कृष्ण बारो दोयमॉय, करीबे जिह्वा जय,\n" +
            "स्व-प्रसाद-अन्ना दिलो भाई\n" +
            "सेई अन्नमृत खाओ, राधा-कृष्ण-गुण गाओ,\n" +
            "प्रेमे दको चैतन्य-निताई\n" +
            "\n" +
            "\n" +
            "\n" +
            "अनुवाद\n" +
            "\n" +
            "हे राजा, जिन लोगों ने बहुत कम पवित्र गतिविधियाँ अर्जित की हैं, उनका महा-प्रसाद, श्री गोविंदा, पवित्र नाम और वैष्णव में विश्वास कभी पैदा नहीं होता है।\n" +
            "\n" +
            "1) हे भाइयो! यह भौतिक शरीर अज्ञान का जाल है, और इंद्रियाँ व्यक्ति की घातक शत्रु हैं, क्योंकि वे आत्मा को भौतिक इंद्रिय भोग के सागर में फेंक देती हैं। इंद्रियों में जीभ सबसे अधिक भूखी और वास्तव में दुष्ट है; इस संसार में जीभ पर विजय पाना बहुत कठिन है।\n" +
            "\n" +
            "2) हे भाइयो! भगवान कृष्ण बहुत दयालु हैं - केवल जीभ को नियंत्रित करने के लिए उन्होंने हमें अपने भोजन के अवशेष दिए हैं! अब कृपया अपने आधिपत्य श्री श्री राधा और कृष्ण की महिमा गाते हुए इन अमृतमय दानों को खाएं, और प्रेम से \"चैतन्य! निताई!\"\n";

    private final MutableLiveData<String> mText;

    public HomeViewModel() {
        mText = new MutableLiveData<>();
        mText.setValue(message);
    }

    public LiveData<String> getText() {
        return mText;
    }
}